import { html,until } from "../lib.js";
import { spinner } from "./common.js";


const technologyTemplate = (onClick) => html`
<div @click=${onClick} class="technology-page">
    <h1 class="technology-title">
        Технология на производството на лозов посадъчен материал
    </h1>
    <section class="technology-content">
        <h3 class="techology-content-subtitle">
            Нормативна уредба и директиви на ЕС:
        </h3>
        <div class="technology-content-text-main">
            <p>
                С оглед заздравяването на вътрешния пазар и за да се премахнат пречките пред свободната
                търговия
                на посадъчен материал в Европейската общност е необходимо да се въведат и спазват определени
                условия за продажба на посадъчен материал, произведен съгласно нови производствени
                технологии.
                За тази цел Съветът на Европейския съюз издаде Директива 68/193, изменена с Директива
                2002/11 от
                14 февруари 2002 г., в която са изложени условията и реда за производството и търговия със
                сертифициран лозов посадъчен материал.
            </p>

        </div>
        <div class="technology-content-text-details">
            <p>
                Целта на тази Директива е да гарантира качеството на посадъчния материал в страните от ЕС
                след
                отпадане на границите в Общността.
                Всяка страна-членка на ЕС трябва да състави Каталог на сортовете, които се допускат до
                сертифициране и до официален контрол на стандартен размножителен материал на своята
                територия. В
                него се определят основните морфологични и физиологични характеристики, които позволяват да
                се
                разграничат отделните сортове.
                Страните - членки на ЕС следва да контролират вписаните сортове в каталозите на другите
                страни –
                членки, допуснати до сертифициране и контрол на стандартен размножителен материал върху
                тяхната
                територия.
                Всяка страна е длъжна да изготвя , когато се наложи списък с клоновете, които са официално
                допуснати за сертифициране на нейна територия.
                За да осигури подходящ контрол при движението на лозов посадъчен материал, всички страни –
                членки трябва да издават придружителни документи за всяка партида.
                Началото за изграждане на Система за сертифициране на лозов посадъчен материал бе поставено
                през
                1999 г. с проекта “Насърчаване на овощарството и лозарството в България и на земеделието в
                планински регион Ловеч”, съвместно с представители на МЗГ , научно-изследователски
                институции и
                Националното сдружение на производителите на лозов посадъчен материал.
                Предвижда се през 2005 г. с подкрепата на проекта на Немското дружество за техническо
                сътрудничество ФАМАД да се изградят на няколко места в страната моделни маточни насаждения
                от
                червени , бели и десертни сортове лози.
                Лозарството е невъзможно без производството на присадени облагородени лози, състоящи се от
                два
                елемента - присадник (калем) от необходимият културен сорт и подложкови резници.
                Предимството е,
                че лозите по-рано плододават и запазват качествата на подбрания сорт.
            </p>
        </div>
        <button class="detailsBtn">
            Още...
        </button>
    </section>
    <section class="technology-content">
        <h3 class="techology-content-subtitle">
            Етапите, свързани с производството, са следните:
        </h3>
        <div class="technology-content-text-main">
            <h5>
                Подготовка на подложковите резници и калеми за присаждане
            </h5>
            <ul>
                <li>
                    <p>
                        Проверка за стандартна дължина и дебелина, узряване, наличие на повреди от
                        измръзване и подсъхване.
                    </p>
                </li>
                <li>
                    <p>
                        Поставяне в резервоари с чиста вода за по-добро калусиране и срастване при
                        присаждането.
                    </p>
                </li>
            </ul>
           
        </div>
        <div class="technology-content-text-details">
            <h5>
                Присаждане на маса
            </h5>
            <ul>
                <li>
                    <p>
                        Oперация, при която се поставя присадника върху подложката и се образува едно цяло
                        растение. Това се извършва с лозароприсаждащи машини, при които отрезите и сглобката
                        имат формата на гръцката буква омега.
                    </p>
                </li>
            </ul>
            <h5>
                Стратифициране на присадените резници (образуване на спойката и начало на срастването
            </h5>
            <ul>
                <li>
                    <p>
                        Парафиниране
                    </p>
                </li>
                <li>
                    <p>
                        Нареждане в дървени сандъци с влажни стърготини
                    </p>
                </li>
                <li>
                    <p>
                        Поставяне в стратификална
                    </p>
                </li>
                <li>
                    <p>
                        Светозакалка във вода на стратифицираните и повторно парафинирани резници
                    </p>
                </li>
            </ul>
            <h5>
                Лехово-лентово вкореняване на лозите и грижи за отглеждането им.
            </h5>
            <h5>
                Изваждане, сортиране и съхраняване на лозите.
            </h5>
        </div>
        <button class="detailsBtn">
                Още...
            </button>
    </section>
    <section class="technology-content">
        <h3 class="techology-content-subtitle">
            Категории размножителен материал:
        </h3>
        <div class="technology-content-text-main">
            <P>
                <strong>Изходен (предбазов) размножителен материал,</strong> който е произведен под отговорността на
                производителя съгласно общоприетите методи за запазване на идентичността на сорта или евентуално на
                клона, като се предотвратява появата на заболявания и е предназначен за производство на базов или
                сертифициран посадъчен материал.
            </P>
           
        </div>
        <div class="technology-content-text-details">
            <P>
                <strong>Базов размножителен материал,</strong> който е бил произведен под отговорността на
                производителя, съгласно общоприетите методи с цел да се запази идентичността на сорта или евентуално на
                клона и да се предотврати появата на заболявания и който е получен директно от изходен материал и е
                предназначен за производство на сертифициран размножителен материал.
            </P>
            <P>
                <strong>Базов размножителен материал,</strong> който е бил произведен под отговорността на
                производителя, съгласно общоприетите методи с цел да се запази идентичността на сорта или евентуално на
                клона и да се предотврати появата на заболявания и който е получен директно от изходен материал и е
                предназначен за производство на сертифициран размножителен материал.
            </P>
            <P>
                <strong>Сертифициран размножителен материал,</strong> който произхожда директно от базов размножителен
                материал от изходен (предбазов) размножителен материал и е предназначен за производството на лозички или
                части от растения, които ще служат за създаване на лозе за производство на грозде.
            </P>
            <P>
                <strong>Стандартен размножителен материал,</strong> който притежава сортова идентичност и чистота и е
                предназначен за производство на лозички или части от растения, които ще служат за създаване на лозе за
                производство на грозде.
            </P>
        </div>
        <button class="detailsBtn">
                Още...
            </button>
    </section>
    <section class="technology-content">
        <h3 class="techology-content-subtitle">
            Списък на вирусните заболявания на лозовия посадъчен материал, подлежащ на лабораторно тестване:
        </h3>
        <div class="technology-content-text-main">
            <ul>
                <li>
                    <p>
                        Вирус на късовъзлието /GFLV - Grapevine Fanleaf Virus/;
                    </p>
                </li>
            </ul>
          
        </div>
        <div class="technology-content-text-details">
            <ul>
                <li>
                    <p>
                        Вирус на арабисовата мозайка /AzMV - Arabis MosaikVirus/;
                    </p>
                </li>
                <li>
                    <p>
                        Вирус на листното завиване при лозата - 1/GLRaV-1 - Grapevine Leafroll Associated Virus – 1/;
                    </p>
                </li>
                <li>
                    <p>
                        Вирус на листното завиване при лозата - 3/GLRaV-3 - Grapevine Leafroll Associated Virus – 3/;
                    </p>
                </li>
                <li>
                    <p>
                        Лозов флек вирус/GfleckV - Grapevine Flek Virus/.
                    </p>
                </li>
            </ul>
        </div>
        <button class="detailsBtn">
                Още...
            </button>
    </section>
    <section class="technology-content">
        <h3 class="techology-content-subtitle">
            Списък на нематодите, които се изследват при лабораторни анализи:
        </h3>
        <div class="technology-content-text-main">
            <ul>
                <li>
                    <p>
                        p.Xiphinema - Xiphinema index, Xiphinema diversicaudatum, Xiphinema italiае;
                    </p>
                </li>
            </ul>
           
        </div>
        <div class="technology-content-text-details">
            <ul>
                <li>
                    <p>
                        p.Longidorus - Longidorus elongga;
                    </p>
                </li>
                <li>
                    <p>
                        p.Paralongidoрus - Paralongidorus maximus;
                    </p>
                </li>
            </ul>
        </div>
        <button class="detailsBtn">
                Още...
            </button>
    </section>
    <section class="redirect-to-home technology">
        <a href="/home">НАЧАЛО</a>
    </section>
</div>`;

export default function technologyView(context) {
    context.render(until(fillTemplate(), spinner()));

   function fillTemplate() {
        return technologyTemplate(onClick);
    };

    function onClick(event) {
        if (event.target.textContent.trim() == 'Още...') {
            event.target.parentNode.querySelector('.technology-content-text-details').style.display = "block";
            event.target.textContent = 'Скрий';
            return;
        }
        if (event.target.textContent.trim() == 'Скрий') {
            event.target.parentNode.querySelector('.technology-content-text-details').style.display = "none";
            event.target.textContent = 'Още...';
            return;
        }
    }
}